Revit 2026 API

# SkyBackgroundSettings Class

---

Represents the rendering sky background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBSkyBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SkyBackgroundSettings : BackgroundSettings
```
```vb
Public Class SkyBackgroundSettings
	Inherits BackgroundSettings
```
```cpp
public ref class SkyBackgroundSettings : public BackgroundSettings
```
```fsharp
type SkyBackgroundSettings =
    class
        inherit BackgroundSettings
    end
```

The SkyBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BackgroundSettings) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from BackgroundSettings) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace